app/Controllers/AdminController.php

SELECT *
FROM `orders`
---
    public function index()
    {
        // Check if user is admin (simple authentication)
        if (!$this->isAdmin()) {
            return redirect()->to(base_url('admin/login'))->with('error', 'Please login to access admin panel');
        }

        $orderModel = new OrderModel();
        $allOrders = $orderModel->findAll();

SELECT *
FROM `lp12_levels`
---
    public function levels()
    {
        if (!$this->isAdmin()) {
            return redirect()->to(base_url('admin/login'));
        }

        $levelModel = new LevelModel();
        $data['levels'] = $levelModel->findAll();

SELECT *
FROM `lp12_levels`
WHERE `lp12_levels`.`id` = '1'
---
    public function editLevel($id)
    {
        if (!$this->isAdmin()) {
            return redirect()->to(base_url('admin/login'));
        }

        $levelModel = new LevelModel();
        $data['level'] = $levelModel->find($id);

SELECT *
FROM `component_categories`
ORDER BY `display_order` ASC
---
    public function categories()
    {
        if (!$this->isAdmin()) {
            return redirect()->to(base_url('admin/login'));
        }

        $categoryModel = new ComponentCategoryModel();
        $data['categories'] = $categoryModel->orderBy('display_order', 'ASC')->findAll();

SELECT *
FROM `component_categories`
WHERE `component_categories`.`id` = '1'
---
    public function editCategory($id)
    {
        if (!$this->isAdmin()) {
            return redirect()->to(base_url('admin/login'));
        }

        $categoryModel = new ComponentCategoryModel();

        $data['category'] = $categoryModel->find($id);

SELECT *
FROM `components`
SELECT *
FROM `component_categories`
ORDER BY `display_order` ASC
---
    public function components()
    {
        if (!$this->isAdmin()) {
            return redirect()->to(base_url('admin/login'));
        }

        $componentModel = new ComponentModel();
        $categoryModel = new ComponentCategoryModel();

        $data['components'] = $componentModel->findAll();
        $data['categories'] = $categoryModel->orderBy('display_order', 'ASC')->findAll();