app/Controllers/CartController.php

    public function summary()
    {
        $session = session();
        $config = $session->get('lp12_config');

        if (!$config) {
            $session->setFlashdata('error', 'No configuration found');
            return redirect()->to(base_url('configurator'));
        }

        $levelModel = new LevelModel();
        $componentModel = new ComponentModel();
        $categoryModel = new ComponentCategoryModel();

        try {
            $level = $levelModel->find($config['level_id']);

            if (!$level) {
                throw new \Exception('Level not found');
            }

            $selectedComponents = [];
            $totalPrice = floatval($level['base_price']);

            // components comes as ['plinth' => '5', 'tonearm' => '7', ...]
            // Key is category name, value is component ID
            foreach ($config['components'] as $catName => $componentId) {
                if (!$componentId) continue;

                $component = $componentModel->find($componentId);
---
SELECT *
FROM `lp12_levels`
WHERE `lp12_levels`.`id` = '2'
SELECT *
FROM `components`
WHERE `components`.`id` = '2'