app/Controllers/Configurator.php

SELECT *
FROM `lp12_levels`
SELECT *
FROM `component_categories`
ORDER BY `display_order` ASC
SELECT *
FROM `components`
SELECT *
FROM `compatibility_map`
---
    public function index()
    {
        // Load data from database
        $levelModel = new \App\Models\LevelModel();
        $categoryModel = new \App\Models\ComponentCategoryModel();
        $componentModel = new \App\Models\ComponentModel();
        $compatibilityModel = new \App\Models\CompatibilityMapModel();

        $data['levels'] = $levelModel->findAll();
        $data['categories'] = $categoryModel->orderBy('display_order', 'ASC')->findAll();
        $data['components'] = $componentModel->findAll();
        $data['compatibilities'] = $compatibilityModel->findAll();